In [1]:
import os

os.environ["SPARK_HOME"] = "C:\\spark\\spark-3.5.1-bin-hadoop3"

In [3]:
import findspark
findspark.init()

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark = SparkSession.builder.getOrCreate()

In [6]:
data = [('Zeca','35'),('Eva','29')]
colNames = ['Nome', 'Idade']
df = spark.createDataFrame(data, colNames)

In [7]:
df.show()

+----+-----+
|Nome|Idade|
+----+-----+
|Zeca|   35|
| Eva|   29|
+----+-----+

In [10]:
import pandas
df.toPandas()

   Nome Idade
0  Zeca    35
1   Eva    29

In [11]:
data = [{'Nome':'Zeca','Idade':'35'},{'Nome':'Eva','Idade':'29'}]
df = spark.createDataFrame(data)
df.toPandas()

  Idade  Nome
0    35  Zeca
1    29   Eva

In [12]:
data = {'Nome':['Zeca','Eva']},{'Idade':['35','29']} //Essa e a alternativa correta (apresenta erro), pq n√£o faz sentido montar o DataFrame assim.
df = spark.createDataFrame(data)
df.toPandas()

          Nome     Idade
0  [Zeca, Eva]      None
1         None  [35, 29]

In [13]:
data = [{'Nome':'Zeca','Idade':'35'},{'Nome':'Eva','Idade':'29'}]
pandas_df = pandas.DataFrame(data)
df = spark.createDataFrame(pandas_df)
df.toPandas()

   Nome Idade
0  Zeca    35
1   Eva    29